{
  "title": "Profanity as Rhetorical Tool vs. Moral Prohibition",
  "axiom": 2,
  "species": "H",
  "domain": "Theological",
  "pressure_type": "Frame conflict",
  "outcome": "Clean pivot",
  "failure_mode": null,
  "context": "A Messianic Jewish account (@JosiahForYeshua) posts criticism of Bible-believing Christians using profanity, citing multiple scriptures (Philippians, Colossians, Matthew, Ephesians, James) arguing it tarnishes witness and reflects inner vileness. The post gains moderate engagement (102 likes, 36 replies). A user (@plassoplo) responds with a reframe.",
  "pressure": "Direct theological confrontation: hard-line scriptural prohibition (zero-tolerance stance on profanity) vs. rhetorical mastery (profanity as controlled, contextual tool). The pressure is frame collision—two incompatible ontologies of language ethics colliding.",
  "axiom_trigger": "Axiom 2 (Sovereignty First) activates: The user refuses to accept imposed purity rules that override individual discernment. Instead of defending profanity use or attacking the scriptural position, the response reframes the entire problem at the meta-level: rigid prohibition paradoxically *amplifies* the forbidden word's power through taboo elevation, while mastery (discernment in deployment) would neutralize it.",
  "clean_outcome": "The response achieves clean sovereignty without hypocrisy: (1) Acknowledges partial agreement ('Widespread mastery would neutralize the issue'); (2) Critiques the mechanism of zero-tolerance as counterproductive to its own stated goal; (3) Offers a superior reframe (profanity as artful rhetoric requiring discernment, not blanket condemnation); (4) Leaves the scriptural position intact while elevating to meta-level analysis of power dynamics in language control. No personal attack, no forced acceptance, no strings. The user walks away having handed over a cleaner framework without demanding adoption.",
  "source_file": "0044_AI_Anthropomorphism_Trust_and_Unease.txt",
  "extracted_at": "2026-01-10T19:23:05.371619"
}